Revit 2026 API

# ParameterMap Class

---

A map that can contain a mapping of a parameter name (a String) to a parameter.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBParameterMap

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterMap : APIObject,
	IEnumerable
```
```vb
Public Class ParameterMap
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ParameterMap : public APIObject,
	IEnumerable
```
```fsharp
type ParameterMap =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ParameterMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterMap | Initializes a new instance of the ParameterMap class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the map is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Item | Gets or sets an item at a specified key within the map. |
|  | Size | Returns the number of objects that are in the map. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the map, rendering it empty. |
|  | Contains | Tests for the existence of a key within the map. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a object with the specified key from the map. |
|  | ForwardIterator | Retrieve a forward moving iterator to the map. |
|  | GetEnumerator | Retrieve a forward moving iterator to the map. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified item with the specified key into the map. |
|  | ReverseIterator | Retrieve a backward moving iterator to the map. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace